{"backend": "tensorflow", "config": [{"config": {"kernel_size": [3, 3], "filters": 32, "trainable": true, "kernel_constraint": null, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_1", "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "filters": 64, "trainable": true, "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 10, "trainable": true, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}